; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj6 obj9 - airport
	obj1 obj7 - city
	obj2 obj5 obj8 obj10 obj13 obj14 obj15 obj16 - package
	obj3 - airplane
	obj4 - location
	obj11 obj12 - truck
)

(:init
	(at obj2 obj0)
	(at obj8 obj6)
	(in-city obj9 obj7)
	(at obj10 obj9)
	(at obj15 obj6)
	(at obj14 obj6)
	(in-city obj6 obj7)
	(at obj5 obj4)
	(at obj16 obj6)
	(at obj12 obj6)
	(at obj13 obj6)
	(at obj3 obj0)
	(at obj11 obj4)
	(in-city obj0 obj1)
	(in-city obj4 obj1)
)

(:goal (and
	(at obj14 obj9)
	(at obj2 obj9)
	(at obj15 obj0)
	(at obj16 obj9)
	(at obj13 obj9)
	(at obj10 obj6)
	(at obj5 obj0)
	(at obj8 obj9)
))
)

; plan
1. (load obj3 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj3)
   goals met: 0 of 8
2. (load obj12 obj8 obj6)
   deleted: (at obj8 obj6)
   added: (in obj8 obj12)
   goals met: 0 of 8
3. (load obj12 obj16 obj6)
   deleted: (at obj16 obj6)
   added: (in obj16 obj12)
   goals met: 0 of 8
4. (load obj12 obj14 obj6)
   deleted: (at obj14 obj6)
   added: (in obj14 obj12)
   goals met: 0 of 8
5. (load obj12 obj13 obj6)
   deleted: (at obj13 obj6)
   added: (in obj13 obj12)
   goals met: 0 of 8
6. (load obj11 obj5 obj4)
   deleted: (at obj5 obj4)
   added: (in obj5 obj11)
   goals met: 0 of 8
7. (drive obj11 obj4 obj0)
   deleted: (at obj11 obj4)
   added: (at obj11 obj0)
   goals met: 0 of 8
8. (unload obj11 obj5 obj0)
   deleted: (in obj5 obj11)
   added: (at obj5 obj0)
   goals met: 1 of 8
9. (fly obj3 obj0 obj6)
   deleted: (at obj3 obj0)
   added: (at obj3 obj6)
   goals met: 1 of 8
10. (load obj3 obj15 obj6)
   deleted: (at obj15 obj6)
   added: (in obj15 obj3)
   goals met: 1 of 8
11. (fly obj3 obj6 obj0)
   deleted: (at obj3 obj6)
   added: (at obj3 obj0)
   goals met: 1 of 8
12. (unload obj3 obj15 obj0)
   deleted: (in obj15 obj3)
   added: (at obj15 obj0)
   goals met: 2 of 8
13. (fly obj3 obj0 obj9)
   deleted: (at obj3 obj0)
   added: (at obj3 obj9)
   goals met: 2 of 8
14. (unload obj3 obj2 obj9)
   deleted: (in obj2 obj3)
   added: (at obj2 obj9)
   goals met: 3 of 8
15. (load obj3 obj10 obj9)
   deleted: (at obj10 obj9)
   added: (in obj10 obj3)
   goals met: 3 of 8
16. (fly obj3 obj9 obj6)
   deleted: (at obj3 obj9)
   added: (at obj3 obj6)
   goals met: 3 of 8
17. (unload obj3 obj10 obj6)
   deleted: (in obj10 obj3)
   added: (at obj10 obj6)
   goals met: 4 of 8
18. (drive obj12 obj6 obj9)
   deleted: (at obj12 obj6)
   added: (at obj12 obj9)
   goals met: 4 of 8
19. (unload obj12 obj8 obj9)
   deleted: (in obj8 obj12)
   added: (at obj8 obj9)
   goals met: 5 of 8
20. (unload obj12 obj16 obj9)
   deleted: (in obj16 obj12)
   added: (at obj16 obj9)
   goals met: 6 of 8
21. (unload obj12 obj14 obj9)
   deleted: (in obj14 obj12)
   added: (at obj14 obj9)
   goals met: 7 of 8
22. (unload obj12 obj13 obj9)
   deleted: (in obj13 obj12)
   added: (at obj13 obj9)
   goals met: 8 of 8
